{
  "architectures": [
    "Mistral3ForConditionalGeneration"
  ],
  "torch_dtype": "bfloat16",
  "image_token_index": 10,
  "model_type": "mistral3",
  "multimodal_projector_bias": false,
  "pad_token_id": 11,
  "projector_hidden_act": "gelu",
  "quantization_config": {
    "activation_scheme": "static",
    "dequantize": false,
    "modules_to_not_convert": [
      "model.vision_tower",
      "model.multi_modal_projector",
      "lm_head"
    ],
    "quant_method": "fp8",
    "weight_block_size": null
  },
  "spatial_merge_size": 2,
  "text_config": {
    "attention_dropout": 0.0,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 5120,
    "initializer_range": 0.02,
    "intermediate_size": 32768,
    "max_position_embeddings": 131072,
    "model_type": "ministral3",
    "num_attention_heads": 32,
    "num_hidden_layers": 40,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-05,
    "rope_parameters": {
      "beta_fast": 32.0,
      "beta_slow": 1.0,
      "factor": 48.0,
      "llama_4_scaling_beta": 0.1,
      "mscale": 1.0,
      "mscale_all_dim": 1.0,
      "original_max_position_embeddings": 8192,
      "rope_theta": 100000000.0,
      "rope_type": "yarn",
      "type": "yarn"
    },
    "sliding_window": 4096,
    "use_cache": true,
    "vocab_size": 131072
  },
  "tie_word_embeddings": false,
  "transformers_version": "5.0.0rc1",
  "unsloth_fixed": true,
  "vision_config": {
    "attention_dropout": 0.0,
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "image_size": 1540,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "model_type": "pixtral",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 24,
    "patch_size": 14,
    "rope_parameters": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    }
  },
  "vision_feature_layer": -1
}
